#1. Реализовать класс Matrix (матрица). Обеспечить перегрузку конструктора класса (метод __init__()),
# который должен принимать данные (список списков) для формирования матрицы.
#Подсказка: матрица — система некоторых математических величин, расположенных в виде прямоугольной схемы.
#Примеры матриц: 3 на 2, 3 на 3, 2 на 4.
#| 31 22 |
#| 37 43 |
#| 51 86 |

#| 3 5 32 |
#| 2 4 6 |
#| -1 64 -8 |

#| 3 5 8 3 |
#| 8 3 7 1 |
#Следующий шаг — реализовать перегрузку метода __str__() для вывода матрицы в привычном виде.
#Далее реализовать перегрузку метода __add__() для сложения двух объектов класса Matrix (двух матриц).
# Результатом сложения должна быть новая матрица.
#Подсказка: сложение элементов матриц выполнять поэлементно.
# Первый элемент первой строки первой матрицы складываем с первым элементом первой строки второй матрицы и пр.


class Matrix(list):
    def __init__(self, matrix):
        self.matrix = matrix
    def __str__(self):
        res = ''
        for i in self.matrix:
            for j in i:
               res += str(j) + "\t"
            res += '\n'
        return res


    def __add__(self, other):
        print("Сложение двух матриц")
        c = []
        for i in range(len(self.matrix)):
            c.append([])
            for j in range(len(self.matrix[0])):
                c[i].append(self.matrix[i][j] + other.matrix[i][j])
        return "\n".join(map(str, c))




a = [[31, 22], [37, 43], [51, 86]]
b = [[3, 5, 32], [2, 4, 6], [-1, 64, -8]]


matr_1 = Matrix(a)
matr_2 = Matrix(b)

print(matr_1)
print()
print(matr_2)
print()
print(matr_1 + matr_2)
