
#1. Создать класс TrafficLight (светофор).
#определить у него один атрибут color (цвет) и метод running (запуск);
#атрибут реализовать как приватный;
#в рамках метода реализовать переключение светофора в режимы: красный, жёлтый, зелёный;
#продолжительность первого состояния (красный) составляет 7 секунд,
# второго (жёлтый) — 2 секунды, третьего (зелёный) — на ваше усмотрение;
#переключение между режимами должно осуществляться только в указанном порядке (красный, жёлтый, зелёный);
#проверить работу примера, создав экземпляр и вызвав описанный метод.
#Задачу можно усложнить, реализовав проверку порядка режимов.
# При его нарушении выводить соответствующее сообщение и завершать скрипт.

import time
import itertools

class TrafficLight:
    __color = [["red", [6, 31]], ["yellow", [2, 33]], ["green", [6, 32]], ["yellow", [2, 33]]]

    def running(self):
        for i in itertools.cycle(self.__color):
            print(f"\r\033[{i[1][1]}m\033[1m{i[0]}\033[0m", end="")
            time.sleep(i[1][0])

tr = TrafficLight()
tr.running()